app/controllers/posts_controller.rb

  def show
    # To set up the variable for our comment form
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "this is a 1st post"], ["content", "yahoo it seems to work"], ["user_id", 1], ["created_at", 2017-03-27 04:35:47 UTC], ["updated_at", 2017-03-27 04:35:47 UTC]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "slug" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["slug", "this-is-a-1st-post"], ["updated_at", 2017-03-29 04:23:19 UTC], ["id", 1]]